Masmiseim36/nxpSDK/devices/MIMXRT735S/iar/startup_MIMXRT735S_cm33_core1.s
        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UsageFault_Handler
        B .

        PUBWEAK SecureFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SecureFault_Handler
        B .

        PUBWEAK SVC_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SVC_Handler
        B .

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
DebugMon_Handler
        B .

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PendSV_Handler
        B .

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SysTick_Handler
        B .

        PUBWEAK Reserved16_IRQHandler
        PUBWEAK Reserved16_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved16_IRQHandler
        LDR     R0, =Reserved16_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved17_IRQHandler
        PUBWEAK Reserved17_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved17_IRQHandler
        LDR     R0, =Reserved17_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved18_IRQHandler
        PUBWEAK Reserved18_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved18_IRQHandler
        LDR     R0, =Reserved18_DriverIRQHandler
        BX      R0

        PUBWEAK FRO2_IRQHandler
        PUBWEAK FRO2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FRO2_IRQHandler
        LDR     R0, =FRO2_DriverIRQHandler
        BX      R0

        PUBWEAK GLIKEY4_IRQHandler
        PUBWEAK GLIKEY4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GLIKEY4_IRQHandler
        LDR     R0, =GLIKEY4_DriverIRQHandler
        BX      R0

        PUBWEAK UTICK1_IRQHandler
        PUBWEAK UTICK1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
UTICK1_IRQHandler
        LDR     R0, =UTICK1_DriverIRQHandler
        BX      R0

        PUBWEAK MRT1_IRQHandler
        PUBWEAK MRT1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MRT1_IRQHandler
        LDR     R0, =MRT1_DriverIRQHandler
        BX      R0

        PUBWEAK CTIMER5_IRQHandler
        PUBWEAK CTIMER5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CTIMER5_IRQHandler
        LDR     R0, =CTIMER5_DriverIRQHandler
        BX      R0

        PUBWEAK CTIMER6_IRQHandler
        PUBWEAK CTIMER6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CTIMER6_IRQHandler
        LDR     R0, =CTIMER6_DriverIRQHandler
        BX      R0

        PUBWEAK CTIMER7_IRQHandler
        PUBWEAK CTIMER7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CTIMER7_IRQHandler
        LDR     R0, =CTIMER7_DriverIRQHandler
        BX      R0

        PUBWEAK LPI2C15_IRQHandler
        PUBWEAK LPI2C15_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C15_IRQHandler
        LDR     R0, =LPI2C15_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM17_IRQHandler
        PUBWEAK LP_FLEXCOMM17_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM17_IRQHandler
        LDR     R0, =LP_FLEXCOMM17_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM18_IRQHandler
        PUBWEAK LP_FLEXCOMM18_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM18_IRQHandler
        LDR     R0, =LP_FLEXCOMM18_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM19_IRQHandler
        PUBWEAK LP_FLEXCOMM19_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM19_IRQHandler
        LDR     R0, =LP_FLEXCOMM19_DriverIRQHandler
        BX      R0

        PUBWEAK LP_FLEXCOMM20_IRQHandler
        PUBWEAK LP_FLEXCOMM20_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LP_FLEXCOMM20_IRQHandler
        LDR     R0, =LP_FLEXCOMM20_DriverIRQHandler
        BX      R0

        PUBWEAK ADC_IRQHandler
        PUBWEAK ADC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ADC_IRQHandler
        LDR     R0, =ADC_DriverIRQHandler
        BX      R0

        PUBWEAK SDADC_IRQHandler
        PUBWEAK SDADC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SDADC_IRQHandler
        LDR     R0, =SDADC_DriverIRQHandler
        BX      R0

        PUBWEAK GLIKEY1_IRQHandler
        PUBWEAK GLIKEY1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GLIKEY1_IRQHandler
        LDR     R0, =GLIKEY1_DriverIRQHandler
        BX      R0

        PUBWEAK ACMP_IRQHandler
        PUBWEAK ACMP_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ACMP_IRQHandler
        LDR     R0, =ACMP_DriverIRQHandler
        BX      R0

        PUBWEAK PDM_EVENT_IRQHandler
        PUBWEAK PDM_EVENT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PDM_EVENT_IRQHandler
        LDR     R0, =PDM_EVENT_DriverIRQHandler
        BX      R0

        PUBWEAK HYPERVISOR_IRQHandler
        PUBWEAK HYPERVISOR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
HYPERVISOR_IRQHandler
        LDR     R0, =HYPERVISOR_DriverIRQHandler
        BX      R0

        PUBWEAK SECURE_VIOLATION_IRQHandler
        PUBWEAK SECURE_VIOLATION_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SECURE_VIOLATION_IRQHandler
        LDR     R0, =SECURE_VIOLATION_DriverIRQHandler
        BX      R0

        PUBWEAK PDM_HWVAD_EVENT_IRQHandler
        PUBWEAK PDM_HWVAD_EVENT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PDM_HWVAD_EVENT_IRQHandler
        LDR     R0, =PDM_HWVAD_EVENT_DriverIRQHandler
        BX      R0

        PUBWEAK RTC1_ALARM_IRQHandler
        PUBWEAK RTC1_ALARM_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
RTC1_ALARM_IRQHandler
        LDR     R0, =RTC1_ALARM_DriverIRQHandler
        BX      R0

        PUBWEAK RTC1_IRQHandler
        PUBWEAK RTC1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
RTC1_IRQHandler
        LDR     R0, =RTC1_DriverIRQHandler
        BX      R0

        PUBWEAK HIFI1_IRQHandler
        PUBWEAK HIFI1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
HIFI1_IRQHandler
        LDR     R0, =HIFI1_DriverIRQHandler
        BX      R0

