Masmiseim36/nxpSDK/devices/MIMXRT735S/iar/startup_MIMXRT735S_cm33_core1.s
        PUBWEAK MU1_B_IRQHandler
        PUBWEAK MU1_B_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MU1_B_IRQHandler
        LDR     R0, =MU1_B_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved43_IRQHandler
        PUBWEAK Reserved43_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved43_IRQHandler
        LDR     R0, =Reserved43_DriverIRQHandler
        BX      R0

        PUBWEAK MU3_A_IRQHandler
        PUBWEAK MU3_A_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MU3_A_IRQHandler
        LDR     R0, =MU3_A_DriverIRQHandler
        BX      R0

        PUBWEAK PMC_IRQHandler
        PUBWEAK PMC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PMC_IRQHandler
        LDR     R0, =PMC_DriverIRQHandler
        BX      R0

        PUBWEAK OS_EVENT_IRQHandler
        PUBWEAK OS_EVENT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
OS_EVENT_IRQHandler
        LDR     R0, =OS_EVENT_DriverIRQHandler
        BX      R0

        PUBWEAK USDHC0_IRQHandler
        PUBWEAK USDHC0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USDHC0_IRQHandler
        LDR     R0, =USDHC0_DriverIRQHandler
        BX      R0

        PUBWEAK USDHC1_IRQHandler
        PUBWEAK USDHC1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USDHC1_IRQHandler
        LDR     R0, =USDHC1_DriverIRQHandler
        BX      R0

        PUBWEAK I3C2_IRQHandler
        PUBWEAK I3C2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I3C2_IRQHandler
        LDR     R0, =I3C2_DriverIRQHandler
        BX      R0

        PUBWEAK USB0_IRQHandler
        PUBWEAK USB0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USB0_IRQHandler
        LDR     R0, =USB0_DriverIRQHandler
        BX      R0

        PUBWEAK USB1_IRQHandler
        PUBWEAK USB1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USB1_IRQHandler
        LDR     R0, =USB1_DriverIRQHandler
        BX      R0

        PUBWEAK WDT2_IRQHandler
        PUBWEAK WDT2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
WDT2_IRQHandler
        LDR     R0, =WDT2_DriverIRQHandler
        BX      R0

        PUBWEAK WDT3_IRQHandler
        PUBWEAK WDT3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
WDT3_IRQHandler
        LDR     R0, =WDT3_DriverIRQHandler
        BX      R0

        PUBWEAK USBPHY0_IRQHandler
        PUBWEAK USBPHY0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USBPHY0_IRQHandler
        LDR     R0, =USBPHY0_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved55_IRQHandler
        PUBWEAK Reserved55_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved55_IRQHandler
        LDR     R0, =Reserved55_DriverIRQHandler
        BX      R0

        PUBWEAK I3C3_IRQHandler
        PUBWEAK I3C3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I3C3_IRQHandler
        LDR     R0, =I3C3_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXIO_IRQHandler
        PUBWEAK FLEXIO_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXIO_IRQHandler
        LDR     R0, =FLEXIO_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved58_IRQHandler
        PUBWEAK Reserved58_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved58_IRQHandler
        LDR     R0, =Reserved58_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved59_IRQHandler
        PUBWEAK Reserved59_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved59_IRQHandler
        LDR     R0, =Reserved59_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved60_IRQHandler
        PUBWEAK Reserved60_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved60_IRQHandler
        LDR     R0, =Reserved60_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA2_CH0_IRQHandler
        PUBWEAK EDMA2_CH0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA2_CH0_IRQHandler
        LDR     R0, =EDMA2_CH0_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA2_CH1_IRQHandler
        PUBWEAK EDMA2_CH1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA2_CH1_IRQHandler
        LDR     R0, =EDMA2_CH1_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA2_CH2_IRQHandler
        PUBWEAK EDMA2_CH2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA2_CH2_IRQHandler
        LDR     R0, =EDMA2_CH2_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA2_CH3_IRQHandler
        PUBWEAK EDMA2_CH3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA2_CH3_IRQHandler
        LDR     R0, =EDMA2_CH3_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA2_CH4_IRQHandler
        PUBWEAK EDMA2_CH4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA2_CH4_IRQHandler
        LDR     R0, =EDMA2_CH4_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA2_CH5_IRQHandler
        PUBWEAK EDMA2_CH5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA2_CH5_IRQHandler
        LDR     R0, =EDMA2_CH5_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA2_CH6_IRQHandler
        PUBWEAK EDMA2_CH6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA2_CH6_IRQHandler
        LDR     R0, =EDMA2_CH6_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA2_CH7_IRQHandler
        PUBWEAK EDMA2_CH7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA2_CH7_IRQHandler
        LDR     R0, =EDMA2_CH7_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA3_CH0_IRQHandler
        PUBWEAK EDMA3_CH0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA3_CH0_IRQHandler
        LDR     R0, =EDMA3_CH0_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA3_CH1_IRQHandler
        PUBWEAK EDMA3_CH1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA3_CH1_IRQHandler
        LDR     R0, =EDMA3_CH1_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA3_CH2_IRQHandler
        PUBWEAK EDMA3_CH2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA3_CH2_IRQHandler
        LDR     R0, =EDMA3_CH2_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA3_CH3_IRQHandler
        PUBWEAK EDMA3_CH3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA3_CH3_IRQHandler
        LDR     R0, =EDMA3_CH3_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA3_CH4_IRQHandler
        PUBWEAK EDMA3_CH4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA3_CH4_IRQHandler
        LDR     R0, =EDMA3_CH4_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA3_CH5_IRQHandler
        PUBWEAK EDMA3_CH5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA3_CH5_IRQHandler
        LDR     R0, =EDMA3_CH5_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA3_CH6_IRQHandler
        PUBWEAK EDMA3_CH6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA3_CH6_IRQHandler
        LDR     R0, =EDMA3_CH6_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA3_CH7_IRQHandler
        PUBWEAK EDMA3_CH7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA3_CH7_IRQHandler
        LDR     R0, =EDMA3_CH7_DriverIRQHandler
        BX      R0

